03_OneraM6_Inviscid/OneraM6_Inviscid_rhoEnergyFoam/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4.1                                 |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

// Field Dictionary

FoamFile
{
    version         2.0;
    format          ascii;
    class           volScalarField;
    object          T;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 0 0 1 0 0 0];

internalField   uniform 1.;

boundaryField
{

    wing 
    {
        type            slip;
    }
    
    symmetry
    {
        type            symmetryPlane;
    }
    
    lateral
    {
        type            zeroGradient;
    }
    
    top
    {
        type            zeroGradient;
    }
    
    outlet
    {
        type            zeroGradient;
    }
    
    bottom
    {
        type            fixedValue;
        value           uniform 1.;
    }
    
    inlet
    {
        type            fixedValue;
        value           uniform 1.;
    }
    
}


// ************************************************************************* //
